_posts/2021-10-12-boj-2805.html
---
layout: post
title: BOJ 9093 단어 뒤집기
tags: STL
---

<div id="outline-container-org33a8cdb" class="outline-2">
<h2 id="org33a8cdb">BOJ 2805 나무 자르기</h2>
</div>

<div id="outline-container-orgd6e71c3" class="outline-2">
<h2 id="orgd6e71c3">접근하기</h2>
<div class="outline-text-2" id="text-orgd6e71c3">
<ul class="org-ul">
<li>이분탐색을 배우는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-org6b7ed95" class="outline-2">
<h2 id="org6b7ed95">코드</h2>
<div class="outline-text-2" id="text-org6b7ed95">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>; 
<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[1000010];

<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #edd400; font-weight: bold;">calc</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">height</span>)
{
    <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val</span> = a[i] - height;
        <span style="color: #729fcf; font-weight: bold;">if</span> (val &lt; 0) val = 0; 
        sum += val;
    }     
    <span style="color: #729fcf; font-weight: bold;">return</span> sum;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #888a85;">//</span><span style="color: #888a85;">freopen("input.txt", "r", stdin);</span>
    <span style="color: #888a85;">//</span><span style="color: #888a85;">freopen("input2.txt", "r", stdin);</span>
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %lld"</span>, &amp;N, &amp;M);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }
    sort(a, a+N);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">left</span> = 0;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">right</span> = 1000000000;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(left &lt;= right) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">mid</span> = (left + right) / 2;
        <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">ret</span> = calc(mid);
        <span style="color: #888a85;">//</span><span style="color: #888a85;">printf("mid %d ret : %lld\n", mid, ret);</span>
        <span style="color: #729fcf; font-weight: bold;">if</span>(ret &gt;= M) {
            ans = mid;    
            left = mid + 1; 
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            right = mid-1;
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ce9fb5" class="outline-2">
<h2 id="org5ce9fb5">문제 링크</h2>
<div class="outline-text-2" id="text-org5ce9fb5">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2805">https://www.acmicpc.net/problem/2805</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3aa9c34" class="outline-2">
<h2 id="org3aa9c34"><span class="todo TODO">TODO</span> 참고자료</h2>
<div class="outline-text-2" id="text-org3aa9c34">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/blog/view/109">이분탐색 헷갈리지 않게 구현하기</a></li>
</ul>
</div>
</div>
